cmsis-svd/cmsis-svd/data/Spansion/MB9BF51xR_svd.xml
        <!-- REGISTER "REVC1" -->
        <register>
          <name>REVC1</name>
          <description>Output Reverse Register 1</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV23" -->
            <field>
              <name>REV23</name>
              <description>PPG23 Output Reverse Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV22" -->
            <field>
              <name>REV22</name>
              <description>PPG22 Output Reverse Enable bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV21" -->
            <field>
              <name>REV21</name>
              <description>PPG21 Output Reverse Enable bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV20" -->
            <field>
              <name>REV20</name>
              <description>PPG20 Output Reverse Enable bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV19" -->
            <field>
              <name>REV19</name>
              <description>PPG19 Output Reverse Enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV18" -->
            <field>
              <name>REV18</name>
              <description>PPG18 Output Reverse Enable bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV17" -->
            <field>
              <name>REV17</name>
              <description>PPG17 Output Reverse Enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV16" -->
            <field>
              <name>REV16</name>
              <description>PPG16 Output Reverse Enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description>PPG Operation Mode Control Register 0</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>PPG Interrupt Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>PPG Counter Underflow bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>Interrupt Mode Select bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>PPG DOWN Counter Operation Clock Select bits</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>PPG Operation Mode Set bits</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description>PPG start trigger select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register derivedFrom="PPGC0">
          <name>PPGC1</name>
          <description>PPG Operation Mode Control Register 1</description>
          <addressOffset>0x200</addressOffset>
        </register>
        <!-- REGISTER "PPGC2" -->
        <register derivedFrom="PPGC0">
          <name>PPGC2</name>
          <description>PPG Operation Mode Control Register 2</description>
          <addressOffset>0x205</addressOffset>
        </register>
        <!-- REGISTER "PPGC3" -->
        <register derivedFrom="PPGC0">
          <name>PPGC3</name>
          <description>PPG Operation Mode Control Register 3</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "PPGC4" -->
        <register derivedFrom="PPGC0">
          <name>PPGC4</name>
          <description>PPG Operation Mode Control Register 4</description>
          <addressOffset>0x241</addressOffset>
        </register>
        <!-- REGISTER "PPGC5" -->
        <register derivedFrom="PPGC0">
          <name>PPGC5</name>
          <description>PPG Operation Mode Control Register 5</description>
          <addressOffset>0x240</addressOffset>
        </register>
        <!-- REGISTER "PPGC6" -->
        <register derivedFrom="PPGC0">
          <name>PPGC6</name>
          <description>PPG Operation Mode Control Register 6</description>
          <addressOffset>0x245</addressOffset>
        </register>
        <!-- REGISTER "PPGC7" -->
        <register derivedFrom="PPGC0">
          <name>PPGC7</name>
          <description>PPG Operation Mode Control Register 7</description>
          <addressOffset>0x244</addressOffset>
        </register>
        <!-- REGISTER "PPGC8" -->
        <register derivedFrom="PPGC0">
          <name>PPGC8</name>
          <description>PPG Operation Mode Control Register 8</description>
          <addressOffset>0x281</addressOffset>
        </register>
        <!-- REGISTER "PPGC9" -->
        <register derivedFrom="PPGC0">
          <name>PPGC9</name>
          <description>PPG Operation Mode Control Register 9</description>
          <addressOffset>0x280</addressOffset>
        </register>
        <!-- REGISTER "PPGC10" -->
        <register derivedFrom="PPGC0">
          <name>PPGC10</name>
          <description>PPG Operation Mode Control Register 10</description>
          <addressOffset>0x285</addressOffset>
        </register>
        <!-- REGISTER "PPGC11" -->
        <register derivedFrom="PPGC0">
          <name>PPGC11</name>
          <description>PPG Operation Mode Control Register 11</description>
          <addressOffset>0x284</addressOffset>
        </register>
        <!-- REGISTER "PPGC12" -->
        <register derivedFrom="PPGC0">
          <name>PPGC12</name>
          <description>PPG Operation Mode Control Register 12</description>
          <addressOffset>0x2C1</addressOffset>
        </register>
